import random

import vk_api
from vk_api.longpoll import VkLongPoll, VkEventType

Russian_Towns = {
    "А": ["Абакан", "Азов", "Александров", "Алексин", "Альметьевск", "Анапа",
          "Ангарск", "Анжеро-Судженск", "Апатиты", "Арзамас", "Армавир",
          "Арсеньев", "Артем", "Архангельск", "Асбест", "Астрахань", "Ачинск"],
    "Б": ["Балаково", "Балахна", "Балашиха", "Балашов", "Барнаул", "Батайск",
          "Белгород", "Белебей", "Белово", "Белогорск", "Белорецк", "Белореченск",
          "Бердск", "Березники", "Березовский", "Бийск", "Биробиджан",
          "Благовещенск", "Борисоглебск", "Боровичи", "Братск", "Брянск",
          "Бугульма", "Буденновск", "Бузулук", "Буйнакск"],
    "В": ["Великие Луки", "Великий Новгород", "Верхняя Пышма", "Видное",
          "Владивосток", "Владикавказ", "Владимир", "Волгоград", "Волгодонск",
          "Волжск", "Волжский", "Вологда", "Вольск", "Воркута", "Воронеж",
          "Воскресенск", "Воткинск", "Всеволожск", "Выборг", "Выкса", "Вязьма"],
    "Г": ["Гатчина", "Геленджик", "Георгиевск", "Глазов", "Горно-Алтайск",
          "Грозный", "Губкин", "Гудермес", "Гуково", "Гусь-Хрустальный"],
    "Д": ["Дербент", "Дзержинск", "Димитровград", "Дмитров", "Долгопрудный",
          "Домодедово", "Донской", "Дубна"],
    "Е": ["Евпатория", "Егорьевск", "Ейск", "Екатеринбург", "Елабуга", "Елец", "Ессентуки"],
    "Ж": ["Железногорск", "Жигулевск", "Жуковский"],
    "З": ["Заречный", "Зеленогорск", "Зеленодольск", "Златоуст"],
    "И": ["Иваново", "Ивантеевка", "Ижевск", "Избербаш", "Иркутск", "Искитим", "Ишим", "Ишимбай"],
    "Й": ["Йошкар-Ола"],
    "К": ["Казань", "Калининград", "Калуга", "Каменск-Уральский", "Каменск-Шахтинский",
          "Камышин", "Канск", "Каспийск", "Кемерово", "Керчь", "Кинешма", "Кириши",
          "Киров", "Кирово-Чепецк", "Киселевск", "Кисловодск", "Клин", "Клинцы",
          "Ковров", "Когалым", "Коломна", "Комсомольск-на-Амуре", "Копейск", "Королев",
          "Кострома", "Котлас", "Красногорск", "Краснодар", "Краснокаменск",
          "Краснокамск", "Краснотурьинск", "Красноярск", "Кропоткин", "Крымск",
          "Кстово", "Кузнецк", "Кумертау", "Кунгур", "Курган", "Курск", "Кызыл"],
    "Л": ["Лабинск", "Лениногорск", "Ленинск-Кузнецкий", "Лесосибирск", "Липецк",
          "Лиски", "Лобня", "Лысьва", "Лыткарино", "Люберцы"],
    "М": ["Магадан", "Магнитогорск", "Майкоп", "Махачкала", "Междуреченск", "Мелеуз",
          "Миасс", "Минеральные Воды", "Минусинск", "Михайловка", "Михайловск",
          "Мичуринск", "Москва", "Мурманск", "Муром", "Мытищи"],
    "Н": ["Набережные Челны", "Назарово", "Назрань", "Нальчик", "Наро-Фоминск", "Находка",
          "Невинномысск", "Нерюнгри", "Нефтекамск", "Нефтеюганск", "Нижневартовск", "Нижнекамск",
          "Нижний Новгород", "Нижний Тагил", "Новоалтайск", "Новокузнецк", "Новокуйбышевск",
          "Новомосковск", "Новороссийск", "Новосибирск", "Новотроицк", "Новоуральск",
          "Новочебоксарск", "Новочеркасск", "Новошахтинск", "Новый Уренгой", "Ногинск",
          "Норильск", "Ноябрьск", "Нягань"],
    "О": ["Обнинск", "Одинцово", "Озерск", "Октябрьский", "Омск", "Орел", "Оренбург",
          "Орехово-Зуево", "Орск"],
    "П": ["Павлово", "Павловский Посад", "Пенза", "Первоуральск", "Пермь", "Петрозаводск",
          "Петропавловск-Камчатский", "Подольск", "Полевской", "Прокопьевск", "Прохладный",
          "Псков", "Пушкино", "Пятигорск"],
    "Р": ["Раменское", "Ревда", "Реутов", "Ржев", "Рославль", "Россошь", "Ростов-на-Дону",
          "Рубцовск", "Рыбинск", "Рязань"],
    "С": ["Салават", "Сальск", "Самара", "Санкт-Петербург", "Саранск", "Сарапул", "Саратов",
          "Саров", "Свободный", "Севастополь", "Северодвинск", "Северск", "Сергиев Посад",
          "Серов", "Серпухов", "Сертолово", "Сибай", "Симферополь", "Славянск-на-Кубани",
          "Смоленск", "Соликамск", "Солнечногорск", "Сосновый Бор", "Сочи", "Ставрополь",
          "Старый Оскол", "Стерлитамак", "Ступино", "Сургут", "Сызрань", "Сыктывкар"],
    "Т": ["Таганрог", "Тамбов", "Тверь", "Тимашевск", "Тихвин", "Тихорецк", "Тобольск",
          "Тольятти", "Томск", "Троицк", "Туапсе", "Туймазы", "Тула", "Тюмень"],
    "У": ["Узловая", "Улан-Удэ", "Ульяновск", "Урус-Мартан", "Усолье-Сибирское",
          "Уссурийск", "Усть-Илимск", "Уфа", "Ухта"],
    "Ф": ["Феодосия", "Фрязино"],
    "Х": ["Хабаровск", "Ханты-Мансийск", "Хасавюрт", "Химки"],
    "Ч": ["Чайковский", "Чапаевск", "Чебоксары", "Челябинск", "Черемхово", "Череповец",
          "Черкесск", "Черногорск", "Чехов", "Чистополь", "Чита"],
    "Ш": ["Шадринск", "Шали", "Шахты", "Шуя"],
    "Щ": ["Щекино", "Щелково"],
    "Э": ["Электросталь", "Элиста", "Энгельс"],
    "Ю": ["Южно-Сахалинск", "Юрга"],
    "Я": ["Якутск", "Ялта", "Ярославль"]
}

Used_Towns = {
    "А": [],
    "Б": [],
    "В": [],
    "Г": [],
    "Д": [],
    "Е": [],
    "Ж": [],
    "З": [],
    "И": [],
    "Й": [],
    "К": [],
    "Л": [],
    "М": [],
    "Н": [],
    "О": [],
    "П": [],
    "Р": [],
    "С": [],
    "Т": [],
    "У": [],
    "Ф": [],
    "Х": [],
    "Ч": [],
    "Ш": [],
    "Щ": [],
    "Э": [],
    "Ю": [],
    "Я": []
}


def write_msg(user_id, message):
    vk.method('messages.send', {'user_id': user_id, 'message': message, 'random_id': random.randint(0, 2048)})


token = "4c372a45b781ca32e1b215c32e208b29faea18f63c85e4e34e1ec5b318d27340d189d4a18c8578df42a47"

vk = vk_api.VkApi(token=token)

longpoll = VkLongPoll(vk)

print("Бот запущен")

f = 0
town = 'Арзамас'
for event in longpoll.listen():
    if event.type == VkEventType.MESSAGE_NEW:
        if event.to_me:
            request = event.text
            mess = request.lower().strip()
            if f == 0:
                write_msg(event.user_id, 'Привет! Если хочешь, можем поиграть с тобой в города. '
                                         'Но, к сожалению, я знаю только города в России((( '
                                         'Хотя я не думаю, что это нам сильно помешает:)')
                f = 1
            if f == 1:
                write_msg(event.user_id, 'Чтобы начать новую игру, пиши "поехали"!')
                f = 2
            elif f == 2:
                if mess == "поехали":
                    write_msg(event.user_id, 'Итак, давай я начну!')
                    write_msg(event.user_id, 'Арзамас')
                    f = 3
                elif mess == 'привет':
                    write_msg(event.user_id, 'Ну привет ещё раз:) Если хочешь поиграть, просто напиши "поехали"')
                else:
                    write_msg(event.user_id, 'Не поняла тебя...')
            elif f == 3:
                ess = mess
                if mess[-1] in 'ёцьъы':
                    ess = mess[:-1]
                print(list(map(lambda x: x.lower(), Russian_Towns[town[0]])))
                print(mess)
                if mess in list(map(lambda x: x.lower(), Russian_Towns[town[-1].upper()])):
                    if mess not in list(map(lambda x: x.lower(), Used_Towns[town[-1].upper()])):
                        Used_Towns[town[0]].append(town)
                        if len(Russian_Towns[ess[0].upper()]) == len(Used_Towns[ess[0].upper()]):
                            write_msg(event.user_id, 'Поздравляю, ты выиграл!')
                            break
                        else:
                            while True:
                                town0 = Russian_Towns[ess[-1].upper()][
                                    random.randint(0, len(Russian_Towns[ess[-1].upper()]))]
                                if town0 not in Used_Towns[ess[-1].upper()]:
                                    write_msg(event.user_id, town0)
                                    town = town0
                                    break
                            for t in Russian_Towns[town[-1].upper()]:
                                if mess == t.lower():
                                    Used_Towns[mess[0].upper()].append(t)
                                    break
                    else:
                        write_msg(event.user_id, 'Такой город уже называли:( Подумай ещё! '
                                                 'Если хочешь закончить игру, напиши "пока"')
                        f = 4
                else:
                    write_msg(event.user_id, 'Не поняла тебя...')
            elif f == 4:
                if mess == 'пока':
                    write_msg(event.user_id, 'Спасибо за игру! Заходи ещё. Буду ждать:)')
                    break
                else:
                    write_msg(event.user_id, 'Повтори ещё раз, пожалуйста')
                    f = 3
